performance/resilience/reports/retry-storm-2026-09-23T04-32-10/k6.summary.txt
     ✗ login 200
      ↳  92% — ✓ 60 / ✗ 5
     ✗ post detail 200
      ↳  92% — ✓ 246 / ✗ 19
     ✓ post_detail_has_id
     ✗ friend list 200
      ↳  92% — ✓ 156 / ✗ 12
     ✗ comment list 200
      ↳  87% — ✓ 151 / ✗ 22

     auth_failures...................................: 5       0.009224/s
     checks..........................................: 93.67%  ✓ 859      ✗ 58  
     ✓ { check:post_detail_has_id,phase:measure }....: 100.00% ✓ 78       ✗ 0   
     ✓ { check:post_detail_has_id,phase:rampdown }...: 100.00% ✓ 85       ✗ 0   
     ✓ { check:post_detail_has_id,phase:warmup }.....: 100.00% ✓ 83       ✗ 0   
     ✓ { phase:measure }.............................: 80.80%  ✓ 240      ✗ 57  
     ✓ { phase:rampdown }............................: 99.64%  ✓ 278      ✗ 1   
     ✓ { phase:warmup }..............................: 100.00% ✓ 341      ✗ 0   
     data_received...................................: 1.6 MB  3.0 kB/s
     data_sent.......................................: 959 kB  1.8 kB/s
     http_req_blocked................................: avg=1.43ms   min=0s       med=1.19ms  max=37.17ms  p(90)=2.35ms   p(95)=2.94ms   p(99)=5.85ms  
     http_req_connecting.............................: avg=1.32ms   min=0s       med=1.11ms  max=37.17ms  p(90)=2.21ms   p(95)=2.72ms   p(99)=5.64ms  
     http_req_duration...............................: avg=28.19ms  min=1.71ms   med=24.1ms  max=216.16ms p(90)=47.02ms  p(95)=61.55ms  p(99)=94.13ms 
     ✓ { expected_response:false,phase:measure }.....: avg=30.77ms  min=5.94ms   med=26.49ms max=216.16ms p(90)=51.41ms  p(95)=66.21ms  p(99)=113.31ms
     ✓ { expected_response:false,phase:rampdown }....: avg=10.5ms   min=6.56ms   med=9.94ms  max=13.77ms  p(90)=13.54ms  p(95)=13.66ms  p(99)=13.75ms 
     ✓ { expected_response:false,phase:warmup }......: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { expected_response:true,phase:measure }......: avg=27.75ms  min=5.85ms   med=24.65ms max=90.24ms  p(90)=46.13ms  p(95)=56.85ms  p(99)=84.74ms 
     ✓ { expected_response:true,phase:rampdown }.....: avg=25.76ms  min=5.85ms   med=23.95ms max=80.21ms  p(90)=42.02ms  p(95)=47.42ms  p(99)=59.49ms 
     ✓ { expected_response:true,phase:warmup }.......: avg=30.26ms  min=5.3ms    med=23.72ms max=134.36ms p(90)=57.05ms  p(95)=86.57ms  p(99)=106.73ms
       { expected_response:true }....................: avg=28ms     min=1.71ms   med=24.03ms max=134.36ms p(90)=46.68ms  p(95)=60.92ms  p(99)=93.6ms  
     ✓ { feature:auth,phase:measure }................: avg=38.97ms  min=5.94ms   med=33.81ms max=184.69ms p(90)=84.51ms  p(95)=89.19ms  p(99)=110.73ms
     ✓ { feature:auth,phase:rampdown }...............: avg=29.91ms  min=6.56ms   med=30.78ms max=47.51ms  p(90)=42.95ms  p(95)=46.4ms   p(99)=47.35ms 
     ✓ { feature:auth,phase:warmup }.................: avg=62.98ms  min=19.65ms  med=76.23ms max=134.36ms p(90)=96.06ms  p(95)=114.13ms p(99)=132.88ms
     ✓ { feature:auth }..............................: avg=45.56ms  min=5.94ms   med=34.65ms max=184.69ms p(90)=90.82ms  p(95)=94.55ms  p(99)=128.06ms
     ✓ { feature:board }.............................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:chat,phase:measure }................: avg=28.57ms  min=19.72ms  med=26.76ms max=45.76ms  p(90)=38.3ms   p(95)=40.14ms  p(99)=43.64ms 
     ✓ { feature:chat,phase:rampdown }...............: avg=29.33ms  min=17.47ms  med=27.24ms max=49.62ms  p(90)=39ms     p(95)=46.89ms  p(99)=48.93ms 
     ✓ { feature:chat,phase:warmup }.................: avg=27.82ms  min=19.38ms  med=25.02ms max=47.86ms  p(90)=37.95ms  p(95)=42.59ms  p(99)=47.73ms 
     ✓ { feature:chat }..............................: avg=28.57ms  min=17.47ms  med=26.38ms max=49.62ms  p(90)=38.45ms  p(95)=43.94ms  p(99)=48.06ms 
     ✓ { feature:comment,phase:measure }.............: avg=34.87ms  min=7.31ms   med=38.78ms max=216.16ms p(90)=57.29ms  p(95)=61.68ms  p(99)=70.9ms  
     ✓ { feature:comment,phase:rampdown }............: avg=32.05ms  min=6.12ms   med=35.39ms max=80.21ms  p(90)=56.06ms  p(95)=59.43ms  p(99)=73.63ms 
     ✓ { feature:comment,phase:warmup }..............: avg=29.38ms  min=6.63ms   med=20.99ms max=77.49ms  p(90)=52.35ms  p(95)=57.82ms  p(99)=72.5ms  
     ✓ { feature:comment }...........................: avg=32.23ms  min=6.12ms   med=32.95ms max=216.16ms p(90)=56.29ms  p(95)=60.82ms  p(99)=73.51ms 
     ✓ { feature:friend,phase:measure }..............: avg=11.88ms  min=5.85ms   med=12.72ms max=16.39ms  p(90)=15.12ms  p(95)=15.6ms   p(99)=16.37ms 
     ✓ { feature:friend,phase:rampdown }.............: avg=11.42ms  min=5.85ms   med=10.87ms max=18.15ms  p(90)=16.04ms  p(95)=16.5ms   p(99)=17.37ms 
     ✓ { feature:friend,phase:warmup }...............: avg=11.16ms  min=5.3ms    med=9.93ms  max=27.43ms  p(90)=16.33ms  p(95)=16.8ms   p(99)=26.55ms 
     ✓ { feature:friend }............................: avg=11.45ms  min=5.3ms    med=11.45ms max=27.43ms  p(90)=15.83ms  p(95)=16.51ms  p(99)=20.73ms 
     ✓ { feature:hot }...............................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:mypage }............................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:notification }......................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:post,phase:measure }................: avg=23.06ms  min=8.45ms   med=20.44ms max=64.85ms  p(90)=36.04ms  p(95)=40.91ms  p(99)=55.89ms 
     ✓ { feature:post,phase:rampdown }...............: avg=21.13ms  min=9.45ms   med=18.49ms max=58.91ms  p(90)=34.19ms  p(95)=38.34ms  p(99)=41.91ms 
     ✓ { feature:post,phase:warmup }.................: avg=22.33ms  min=8.15ms   med=19.99ms max=89.95ms  p(90)=35.31ms  p(95)=42.4ms   p(99)=47.44ms 
     ✓ { feature:post }..............................: avg=22.26ms  min=8.15ms   med=19.48ms max=89.95ms  p(90)=35.47ms  p(95)=41.02ms  p(99)=49.85ms 
     ✓ { feature:reaction,phase:measure }............: avg=30.35ms  min=21.39ms  med=26.84ms max=87.36ms  p(90)=39.09ms  p(95)=46.26ms  p(99)=64.32ms 
     ✓ { feature:reaction,phase:rampdown }...........: avg=26.69ms  min=20.47ms  med=25.07ms max=41.76ms  p(90)=34.29ms  p(95)=35.5ms   p(99)=38.81ms 
     ✓ { feature:reaction,phase:warmup }.............: avg=26.4ms   min=19.73ms  med=24.51ms max=46.68ms  p(90)=35.65ms  p(95)=38.87ms  p(99)=45.11ms 
     ✓ { feature:reaction }..........................: avg=28.01ms  min=19.73ms  med=25.36ms max=87.36ms  p(90)=36.59ms  p(95)=39.81ms  p(99)=55.82ms 
     ✓ { feature:school }............................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { feature:scrap,phase:measure }...............: avg=25.03ms  min=18ms     med=22.29ms max=41.93ms  p(90)=33.12ms  p(95)=34.44ms  p(99)=39.87ms 
     ✓ { feature:scrap,phase:rampdown }..............: avg=26.67ms  min=17.59ms  med=24.03ms max=45.25ms  p(90)=37.76ms  p(95)=41.44ms  p(99)=43.82ms 
     ✓ { feature:scrap,phase:warmup }................: avg=24.26ms  min=16.18ms  med=21.28ms max=49.09ms  p(90)=35.73ms  p(95)=40.63ms  p(99)=48.39ms 
     ✓ { feature:scrap }.............................: avg=25.31ms  min=16.18ms  med=22.29ms max=49.09ms  p(90)=35.49ms  p(95)=40.78ms  p(99)=47.07ms 
     ✓ { feature:timetable }.........................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:board_list }...........................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:chat_mark_read }.......................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:chat_messages }........................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:chat_read_status }.....................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:chat_rooms }...........................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:comment_create }.......................: avg=49.06ms  min=23.74ms  med=46.64ms max=216.16ms p(90)=60.74ms  p(95)=68ms     p(99)=78.17ms 
     ✓ { name:comment_delete }.......................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:comment_list }.........................: avg=15.1ms   min=6.12ms   med=14.62ms max=38.81ms  p(90)=23.45ms  p(95)=26.59ms  p(99)=32.64ms 
     ✓ { name:comment_reaction }.....................: avg=27.57ms  min=19.73ms  med=24.86ms max=56.67ms  p(90)=37.5ms   p(95)=41.34ms  p(99)=48.38ms 
     ✓ { name:comment_update }.......................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:friend_list }..........................: avg=11.45ms  min=5.3ms    med=11.45ms max=27.43ms  p(90)=15.83ms  p(95)=16.51ms  p(99)=20.73ms 
     ✓ { name:friend_req_received }..................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:friend_request }.......................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:friend_respond }.......................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:friend_search }........................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:hot_daily }............................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:login }................................: avg=89.79ms  min=73.64ms  med=87.41ms max=134.36ms p(90)=103.81ms p(95)=115.01ms p(99)=133.34ms
     ✓ { name:logout }...............................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:meal_month }...........................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:meal_today }...........................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:my_comments }..........................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:my_posts }.............................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:notif_list }...........................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:notif_read_all }.......................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:notif_read_one }.......................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:notif_unread_count }...................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:post_create }..........................: avg=31.45ms  min=17.85ms  med=30.03ms max=89.95ms  p(90)=41.52ms  p(95)=44.67ms  p(99)=61.05ms 
     ✓ { name:post_delete }..........................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:post_detail }..........................: avg=16.54ms  min=8.15ms   med=16.18ms max=64.67ms  p(90)=22.52ms  p(95)=26.68ms  p(99)=36.69ms 
     ✓ { name:post_list_deep }.......................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:post_list }............................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:post_reaction }........................: avg=28.28ms  min=20.47ms  med=25.74ms max=87.36ms  p(90)=36.14ms  p(95)=38.97ms  p(99)=57.86ms 
     ✓ { name:post_search }..........................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:post_update }..........................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:school_search }........................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:scrap_list }...........................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:scrap_toggle }.........................: avg=25.31ms  min=16.18ms  med=22.29ms max=49.09ms  p(90)=35.49ms  p(95)=40.78ms  p(99)=47.07ms 
     ✓ { name:subject_list }.........................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:template_list }........................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:timetable_today }......................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { name:token_refresh }........................: avg=29.94ms  min=5.94ms   med=30.7ms  max=184.69ms p(90)=42.1ms   p(95)=45.81ms  p(99)=47.59ms 
     ✓ { name:user_info }............................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { op:auth }...................................: avg=45.56ms  min=5.94ms   med=34.65ms max=184.69ms p(90)=90.82ms  p(95)=94.55ms  p(99)=128.06ms
     ✓ { page:0 }....................................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { page:1 }....................................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { page:2 }....................................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { page:3 }....................................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { page:4 }....................................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { phase:measure,status:0 }....................: avg=32.44ms  min=6.88ms   med=28ms    max=216.16ms p(90)=53.35ms  p(95)=67.02ms  p(99)=127.07ms
     ✓ { phase:measure,status:401 }..................: avg=13.29ms  min=5.94ms   med=12.01ms max=35.93ms  p(90)=17.21ms  p(95)=23.55ms  p(99)=33.46ms 
     ✓ { phase:measure,status:429 }..................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { phase:measure,status:500 }..................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { phase:measure,status:502 }..................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { phase:measure,status:503 }..................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { phase:measure,status:504 }..................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { phase:measure }.............................: avg=28.68ms  min=5.85ms   med=25.01ms max=216.16ms p(90)=47.7ms   p(95)=59.34ms  p(99)=88.45ms 
     ✓ { phase:rampdown,status:0 }...................: avg=9.94ms   min=9.94ms   med=9.94ms  max=9.94ms   p(90)=9.94ms   p(95)=9.94ms   p(99)=9.94ms  
     ✓ { phase:rampdown,status:401 }.................: avg=10.56ms  min=6.56ms   med=10.95ms max=13.77ms  p(90)=13.57ms  p(95)=13.67ms  p(99)=13.75ms 
     ✓ { phase:rampdown,status:429 }.................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { phase:rampdown,status:500 }.................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { phase:rampdown,status:502 }.................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { phase:rampdown,status:503 }.................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { phase:rampdown,status:504 }.................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { phase:rampdown }............................: avg=25.45ms  min=5.85ms   med=23.72ms max=80.21ms  p(90)=41.98ms  p(95)=47.41ms  p(99)=59.43ms 
     ✓ { phase:warmup,status:0 }.....................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { phase:warmup,status:401 }...................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { phase:warmup,status:429 }...................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { phase:warmup,status:500 }...................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { phase:warmup,status:502 }...................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { phase:warmup,status:503 }...................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { phase:warmup,status:504 }...................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     ✓ { phase:warmup }..............................: avg=30.26ms  min=5.3ms    med=23.72ms max=134.36ms p(90)=57.05ms  p(95)=86.57ms  p(99)=106.73ms
     http_req_failed.................................: 11.37%  ✓ 195      ✗ 1519
     ✓ { feature:auth,phase:measure }................: 52.87%  ✓ 46       ✗ 41  
     ✓ { feature:auth,phase:rampdown }...............: 14.70%  ✓ 10       ✗ 58  
     ✓ { feature:auth,phase:warmup }.................: 0.00%   ✓ 0        ✗ 94  
     ✓ { feature:chat,phase:measure }................: 30.43%  ✓ 14       ✗ 32  
     ✓ { feature:chat,phase:rampdown }...............: 0.00%   ✓ 0        ✗ 60  
     ✓ { feature:chat,phase:warmup }.................: 0.00%   ✓ 0        ✗ 61  
     ✓ { feature:comment,phase:measure }.............: 37.20%  ✓ 48       ✗ 81  
     ✓ { feature:comment,phase:rampdown }............: 0.93%   ✓ 1        ✗ 106 
     ✓ { feature:comment,phase:warmup }..............: 0.00%   ✓ 0        ✗ 113 
     ✓ { feature:friend,phase:measure }..............: 25.53%  ✓ 12       ✗ 35  
     ✓ { feature:friend,phase:rampdown }.............: 0.00%   ✓ 0        ✗ 60  
     ✓ { feature:friend,phase:warmup }...............: 0.00%   ✓ 0        ✗ 61  
     ✓ { feature:post,phase:measure }................: 20.73%  ✓ 34       ✗ 130 
     ✓ { feature:post,phase:rampdown }...............: 0.00%   ✓ 0        ✗ 125 
     ✓ { feature:post,phase:warmup }.................: 0.00%   ✓ 0        ✗ 141 
     ✓ { feature:reaction,phase:measure }............: 30.68%  ✓ 27       ✗ 61  
     ✓ { feature:reaction,phase:rampdown }...........: 0.00%   ✓ 0        ✗ 70  
     ✓ { feature:reaction,phase:warmup }.............: 0.00%   ✓ 0        ✗ 70  
     ✓ { feature:scrap,phase:measure }...............: 9.09%   ✓ 3        ✗ 30  
     ✓ { feature:scrap,phase:rampdown }..............: 0.00%   ✓ 0        ✗ 42  
     ✓ { feature:scrap,phase:warmup }................: 0.00%   ✓ 0        ✗ 46  
     ✓ { phase:measure }.............................: 30.97%  ✓ 184      ✗ 410 
     ✓ { phase:rampdown }............................: 2.06%   ✓ 11       ✗ 521 
     ✓ { phase:warmup }..............................: 0.00%   ✓ 0        ✗ 586 
     http_req_receiving..............................: avg=154.02µs min=0s       med=0s      max=4.27ms   p(90)=548.53µs p(95)=692.83µs p(99)=1.46ms  
     http_req_sending................................: avg=103.31µs min=0s       med=0s      max=3.01ms   p(90)=549.63µs p(95)=667.14µs p(99)=1.02ms  
     http_req_tls_handshaking........................: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     http_req_waiting................................: avg=27.93ms  min=1.71ms   med=23.74ms max=216.16ms p(90)=46.87ms  p(95)=61.23ms  p(99)=93.77ms 
     http_reqs.......................................: 1714    3.161926/s
     ✓ { expected_response:false,phase:measure }.....: 184     0.339437/s
     ✓ { expected_response:false,phase:rampdown }....: 11      0.020292/s
     ✓ { expected_response:false,phase:warmup }......: 0       0/s
     ✓ { feature:auth,phase:measure }................: 87      0.160494/s
     ✓ { feature:auth,phase:rampdown }...............: 68      0.125444/s
     ✓ { feature:auth,phase:warmup }.................: 94      0.173408/s
     ✓ { feature:auth }..............................: 249     0.459346/s
     ✓ { feature:board }.............................: 0       0/s
     ✓ { feature:chat,phase:measure }................: 46      0.084859/s
     ✓ { feature:chat,phase:rampdown }...............: 60      0.110686/s
     ✓ { feature:chat,phase:warmup }.................: 61      0.112531/s
     ✓ { feature:chat }..............................: 167     0.308076/s
     ✓ { feature:comment,phase:measure }.............: 129     0.237975/s
     ✓ { feature:comment,phase:rampdown }............: 107     0.19739/s
     ✓ { feature:comment,phase:warmup }..............: 113     0.208458/s
     ✓ { feature:comment }...........................: 349     0.643823/s
     ✓ { feature:friend,phase:measure }..............: 47      0.086704/s
     ✓ { feature:friend,phase:rampdown }.............: 60      0.110686/s
     ✓ { feature:friend,phase:warmup }...............: 61      0.112531/s
     ✓ { feature:friend }............................: 168     0.30992/s
     ✓ { feature:hot }...............................: 0       0/s
     ✓ { feature:mypage }............................: 0       0/s
     ✓ { feature:notification }......................: 0       0/s
     ✓ { feature:post,phase:measure }................: 164     0.302541/s
     ✓ { feature:post,phase:rampdown }...............: 125     0.230596/s
     ✓ { feature:post,phase:warmup }.................: 141     0.260112/s
     ✓ { feature:post }..............................: 430     0.793249/s
     ✓ { feature:reaction,phase:measure }............: 88      0.162339/s
     ✓ { feature:reaction,phase:rampdown }...........: 70      0.129134/s
     ✓ { feature:reaction,phase:warmup }.............: 70      0.129134/s
     ✓ { feature:reaction }..........................: 228     0.420606/s
     ✓ { feature:school }............................: 0       0/s
     ✓ { feature:scrap,phase:measure }...............: 33      0.060877/s
     ✓ { feature:scrap,phase:rampdown }..............: 42      0.07748/s
     ✓ { feature:scrap,phase:warmup }................: 46      0.084859/s
     ✓ { feature:scrap }.............................: 121     0.223216/s
     ✓ { feature:timetable }.........................: 0       0/s
     ✓ { name:board_list }...........................: 0       0/s
     ✓ { name:chat_mark_read }.......................: 0       0/s
     ✓ { name:chat_messages }........................: 0       0/s
     ✓ { name:chat_read_status }.....................: 0       0/s
     ✓ { name:chat_rooms }...........................: 0       0/s
     ✓ { name:comment_create }.......................: 176     0.324679/s
     ✓ { name:comment_delete }.......................: 0       0/s
     ✓ { name:comment_list }.........................: 173     0.319144/s
     ✓ { name:comment_reaction }.....................: 86      0.15865/s
     ✓ { name:comment_update }.......................: 0       0/s
     ✓ { name:friend_list }..........................: 168     0.30992/s
     ✓ { name:friend_req_received }..................: 0       0/s
     ✓ { name:friend_request }.......................: 0       0/s
     ✓ { name:friend_respond }.......................: 0       0/s
     ✓ { name:friend_search }........................: 0       0/s
     ✓ { name:hot_daily }............................: 0       0/s
     ✓ { name:login }................................: 65      0.11991/s
     ✓ { name:logout }...............................: 0       0/s
     ✓ { name:meal_month }...........................: 0       0/s
     ✓ { name:meal_today }...........................: 0       0/s
     ✓ { name:my_comments }..........................: 0       0/s
     ✓ { name:my_posts }.............................: 0       0/s
     ✓ { name:notif_list }...........................: 0       0/s
     ✓ { name:notif_read_all }.......................: 0       0/s
     ✓ { name:notif_read_one }.......................: 0       0/s
     ✓ { name:notif_unread_count }...................: 0       0/s
     ✓ { name:post_create }..........................: 165     0.304386/s
     ✓ { name:post_delete }..........................: 0       0/s
     ✓ { name:post_detail }..........................: 265     0.488863/s
     ✓ { name:post_list_deep }.......................: 0       0/s
     ✓ { name:post_list }............................: 0       0/s
     ✓ { name:post_reaction }........................: 142     0.261957/s
     ✓ { name:post_search }..........................: 0       0/s
     ✓ { name:post_update }..........................: 0       0/s
     ✓ { name:school_search }........................: 0       0/s
     ✓ { name:scrap_list }...........................: 0       0/s
     ✓ { name:scrap_toggle }.........................: 121     0.223216/s
     ✓ { name:subject_list }.........................: 0       0/s
     ✓ { name:template_list }........................: 0       0/s
     ✓ { name:timetable_today }......................: 0       0/s
     ✓ { name:token_refresh }........................: 184     0.339437/s
     ✓ { name:user_info }............................: 0       0/s
     ✓ { op:auth }...................................: 249     0.459346/s
     ✓ { op:read }...................................: 606     1.117927/s
     ✓ { op:write }..................................: 857     1.580963/s
     ✓ { page:0 }....................................: 0       0/s
     ✓ { page:1 }....................................: 0       0/s
     ✓ { page:2 }....................................: 0       0/s
     ✓ { page:3 }....................................: 0       0/s
     ✓ { page:4 }....................................: 0       0/s
     ✓ { phase:measure,status:0 }....................: 168     0.30992/s
     ✓ { phase:measure,status:401 }..................: 16      0.029516/s
     ✓ { phase:measure,status:429 }..................: 0       0/s
     ✓ { phase:measure,status:500 }..................: 0       0/s
     ✓ { phase:measure,status:502 }..................: 0       0/s
     ✓ { phase:measure,status:503 }..................: 0       0/s
     ✓ { phase:measure,status:504 }..................: 0       0/s
     ✓ { phase:measure }.............................: 594     1.09579/s
     ✓ { phase:rampdown,status:0 }...................: 1       0.001845/s
     ✓ { phase:rampdown,status:401 }.................: 10      0.018448/s
     ✓ { phase:rampdown,status:429 }.................: 0       0/s
     ✓ { phase:rampdown,status:500 }.................: 0       0/s
     ✓ { phase:rampdown,status:502 }.................: 0       0/s
     ✓ { phase:rampdown,status:503 }.................: 0       0/s
     ✓ { phase:rampdown,status:504 }.................: 0       0/s
     ✓ { phase:rampdown }............................: 532     0.981415/s
     ✓ { phase:warmup,status:0 }.....................: 0       0/s
     ✓ { phase:warmup,status:401 }...................: 0       0/s
     ✓ { phase:warmup,status:429 }...................: 0       0/s
     ✓ { phase:warmup,status:500 }...................: 0       0/s
     ✓ { phase:warmup,status:502 }...................: 0       0/s
     ✓ { phase:warmup,status:503 }...................: 0       0/s
     ✓ { phase:warmup,status:504 }...................: 0       0/s
     ✓ { phase:warmup }..............................: 586     1.081032/s
     idem_intent.....................................: 954     1.759905/s
     ✓ { action:comment_create }.....................: 157     0.289628/s
     ✓ { action:comment_like }.......................: 79      0.145736/s
     ✓ { action:group_room }.........................: 156     0.287783/s
     ✓ { action:post_create }........................: 152     0.280404/s
     ✓ { action:post_like }..........................: 128     0.23613/s
     ✓ { action:scrap }..............................: 118     0.217682/s
     ✓ { action:token_refresh }......................: 164     0.302541/s
     idem_retried....................................: 87      0.160494/s
     ✓ { action:comment_create }.....................: 19      0.035051/s
     ✓ { action:comment_like }.......................: 7       0.012913/s
     ✓ { action:group_room }.........................: 11      0.020292/s
     ✓ { action:post_create }........................: 13      0.023982/s
     ✓ { action:post_like }..........................: 14      0.025827/s
     ✓ { action:scrap }..............................: 3       0.005534/s
     ✓ { action:token_refresh }......................: 20      0.036895/s
     idem_skipped....................................: 125     0.230596/s
     ✓ { action:comment_create }.....................: 0       0/s
     ✓ { action:comment_like }.......................: 94      0.173408/s
     ✓ { action:group_room }.........................: 12      0.022137/s
     ✓ { action:post_create }........................: 0       0/s
     ✓ { action:post_like }..........................: 8       0.014758/s
     ✓ { action:scrap }..............................: 11      0.020292/s
     ✓ { action:token_refresh }......................: 0       0/s
     idem_unknown....................................: 45      0.083014/s
     ✓ { action:comment_create }.....................: 8       0.014758/s
     ✓ { action:comment_like }.......................: 2       0.00369/s
     ✓ { action:group_room }.........................: 3       0.005534/s
     ✓ { action:post_create }........................: 2       0.00369/s
     ✓ { action:post_like }..........................: 4       0.007379/s
     ✓ { action:scrap }..............................: 0       0/s
     ✓ { action:token_refresh }......................: 26      0.047964/s
     iteration_duration..............................: avg=2.57s    min=335.95ms med=2.52s   max=5.96s    p(90)=3.81s    p(95)=3.95s    p(99)=4.39s   
     iterations......................................: 1079    1.990501/s
     ✓ { phase:measure }.............................: 0       0/s
     ✓ { phase:rampdown }............................: 0       0/s
     ✓ { phase:warmup }..............................: 0       0/s
     phase_iterations................................: 1074    1.981277/s
     ✓ { phase:measure }.............................: 355     0.654891/s
     ✓ { phase:rampdown }............................: 364     0.671494/s
     ✓ { phase:warmup }..............................: 355     0.654891/s
     session_lost....................................: 15      0.027671/s
     view_expected...................................: 246     0.453812/s
     view_unknown....................................: 19      0.035051/s
     vus.............................................: 1       min=1      max=9 
     vus_max.........................................: 50      min=50     max=50